#ifndef GFX_PATCHES_H
#define GFX_PATCHES_H
typedef struct {
    s8 renderFlag;
    s8 unk2;
    u8 unk3;
    u8 unk4;
    u8 unk5;
    u8 unk6;
    u8 unkFlag;
    u8 unk9;
    u8 unkA;
    u8 unkB;
    s8 bufferIndex;
    s32 unkC;
    s32 unk10;
    s16 unk14;
    s16 unk16;
    s16 unk18;
    s16 unk1A;
    s32 unk1C;
    s32 unk20;
    s32 unk24;
    s32 unk28;
    s32 unk2C;
    s32 unk30;
    s32 unk34;
    s32 unk38;
    s32 unk3C;
    s32 unk40;
    s32 unk44;
    s32 unk48;
    s32 unk4C;
    s32 unk50;
    s16 unk54;
    s16 unk56;
    s32 unk58;
    s32 unk5C;
    s32 unk60;
    s32 unk64;
    s32 unk68;
    s32 unk6C;
    s32 unk70;
    s16 unk74;
    s8 unk76;
    s8 unk77;
    s32 unk78;
    s32 unk7C;
    s32 unk80;
    s32 unk84;
    s32 unk88;
    s32 unk8C;
    s32 unk90;
    s32 unk94;
    s32 unk98;
    s32 unk9C;
    s32 unkA0;
    s32 unkA4;
    s32 unkA8;
    s32 unkAC;
    s32 unkB0;
    s32 unkB4;
    s32 unkB8;
    s32 unkBC;
    s32 unkC0;
    s32 unkC4;
    s32 unkC8;
    s32 unkCC;
    s32 unkD0;
    s32 unkD4;
    s32 unkD8;
    s32 unkDC;
    s32 unkE0;
    s32 unkE4;
    s32 unkE8;
    s32 unkEC;
    s32 unkF0;
    s32 unkF4;
    s32 unkF8;
    s32 unkFC;
    s32 unk100;
    s32 unk104;
    s32 unk108;
    s32 unk10C;
    s32 unk110;
    s32 unk114;
    s32 unk118;
    s32 unk11C;
    s32 unk120;
    s32 unk124;
    s32 unk128;
    s32 unk12C;
    s32 unk130;
    s32 unk134;
    s32 unk138;
    s32 unk13C;
    s32 unk140;
    s32 unk144;
    s32 unk148;
    s32 unk14C;
    s32 unk150;
    s32 unk154;
    s32 unk158;
    s32 unk15C;
    s32 unk160;
    s32 unk164;
    s32 unk168;
    s32 unk16C;
    s32 unk170;
    s32 unk174;
    s32 unk178;
    s32 unk17C;
    s32 unk180;
    s32 unk184;
    s32 unk188;
    s32 unk18C;
    s32 unk190;
    s32 unk194;
    s32 unk198;
    s32 unk19C;
    s32 unk1A0;
    s32 unk1A4;
    s32 unk1A8;
    s32 unk1AC;
    s32 unk1B0;
    s32 unk1B4;
    s32 unk1B8;
    s32 unk1BC;
    s32 unk1C0;
    s32 unk1C4;
    s32 unk1C8;
    s32 unk1CC;
    s32 unk1D0;
    s32 unk1D4;
    s32 unk1D8;
    s32 unk1DC;
    s32 unk1E0;
    s32 unk1E4;
    s32 unk1E8;
    s32 unk1EC;
    s32 unk1F0;
    s32 unk1F4;
    s32 unk1F8;
    s32 unk1FC;
    s32 unk200;
    s32 unk204;
    s32 unk208;
    s32 unk20C;
    s32 unk210;
    s32 unk214;
    s32 unk218;
    s32 unk21C;
    s32 unk220;
    s32 unk224;
    s32 unk228;
    s32 unk22C;
    s32 unk230;
    s32 unk234;
    s32 unk238;
    s32 unk23C;
    s32 unk240;
    s32 unk244;
    s32 unk248;
    s32 unk24C;
    s32 unk250;
    s32 unk254;
    s32 unk258;
    s32 unk25C;
    s32 unk260;
    s32 unk264;
    s32 unk268;
    s32 unk26C;
    s32 unk270;
    s32 unk274;
    s32 unk278;
    s32 unk27C;
    s32 unk280;
    s32 unk284;
    s32 unk288;
    s32 unk28C;
    s32 unk290;
    s32 unk294;
    s32 unk298;
    s32 unk29C;
    s32 unk2A0;
    s32 unk2A4;
    s32 unk2A8;
    s32 unk2AC;
    s32 unk2B0;
    s32 unk2B4;
    s32 unk2B8;
    s32 unk2BC;
    s32 unk2C0;
    s32 unk2C4;
    s32 unk2C8;
    s32 unk2CC;
    s32 unk2D0;
    s32 unk2D4;
    s32 unk2D8;
    s32 unk2DC;
    s32 unk2E0;
    s32 unk2E4;
    s32 unk2E8;
    s32 unk2EC;
    s32 unk2F0;
    s32 unk2F4;
    s32 unk2F8;
    s32 unk2FC;
    s32 unk300;
    s32 unk304;
    s32 unk308;
    s32 unk30C;
    s32 unk310;
    s32 unk314;
    s32 unk318;
    s32 unk31C;
    s32 unk320;
    s32 unk324;
    s32 unk328;
    s32 unk32C;
    s32 unk330;
    s32 unk334;
    s32 unk338;
    s32 unk33C;
    s32 unk340;
    s32 unk344;
    s32 unk348;
    s32 unk34C;
    s32 unk350;
    s32 unk354;
    s32 unk358;
    s32 unk35C;
    s32 unk360;
    s32 unk364;
    s32 unk368;
    s32 unk36C;
    s32 unk370;
    s32 unk374;
    s32 unk378;
    s32 unk37C;
    s32 unk380;
    s32 unk384;
    s32 unk388;
    s32 unk38C;
    s32 unk390;
    s32 unk394;
    s32 unk398;
    s32 unk39C;
    s32 unk3A0;
    s32 unk3A4;
    s32 unk3A8;
    s32 unk3AC;
    s32 unk3B0;
    s32 unk3B4;
    s32 unk3B8;
    s32 unk3BC;
    s32 unk3C0;
    s32 unk3C4;
} NPCActor; // size = 0x3C8;

typedef struct StaticActor {
    s8 funcIndex;
    s8 arrayNum;
    s8 actorType;
    s8 unk_3;
    u16 field4_0x4;
    u8 actorState;
    s32 field7_0x7;
    s32 field11_0xb;
    s32 field16_0x10;
    void* actorModelPtr;
    s8 field12_0x13;
    s32 field21_0x18;
    u16 field25_0x1c;
    u16 field27_0x1e;
    u16 field29_0x20;
    s32 field31_0x22;
    s32 field35_0x26;
    s32 field39_0x2a;
    s32 field43_0x2e;
    s32 field47_0x32;
    u16 field51_0x36;
    u16 field53_0x38;
    u16 field55_0x3a;
    u16 field57_0x3c;
    s32 field59_0x3e;
    s32 field63_0x42;
    s16 field67_0x46;
    s8 field69_0x48;
    s8 field70_0x49;
    s32 field71_0x4a;
    s32 field75_0x4e;
    s32 field79_0x52;
    // s32 field83_0x56;
} StaticActor; // size = 0x5C;

typedef struct {
    s8 renderFlag;
    s8 unk2;
    u8 unk3;
    u8 unk4;
    u8 unk5;
    u8 unk6;
    u8 unkFlag;
    u8 unk9;
    u8 unkA;
    u8 unkB;
    s8 bufferIndex;
    s32 unks [360];
} MultiPartActor; // size = 0x5AC;

// typedef struct {
//     s8 renderFlag;
//     s8 unk2;
//     u8 unk3;
//     u8 unk4;
//     u8 unk5;
//     u8 unk6;
//     u8 unkFlag;
//     u8 unk9;
//     u8 unkA;
//     u8 unkB;
//     s8 bufferIndex;
//     s32 unks [239];
// } NPCActor; // size = 0x3C8;

typedef struct ArenaNode {
    struct ArenaNode* next;
    struct ArenaNode* prev;
    void* body;
} ArenaNode;

typedef struct ArenaFuncNode {
    void* func;
    void* arg;
    s8 arenaIndex;
    s8 unk11;
    s16 unk12;
    s32 unk14;
} ArenaFuncNode;

typedef struct GfxContext{
    /* 0x00 */ struct ArenaNode* arenaStart[16];
    /* 0x40 */ struct ArenaNode* arenaNext[16];
    /* 0x80 */ s16 unk_80;
    /* 0x82 */ s16 unk_82;
    /* 0x84 */ s16 unk_84;
    /* 0x86 */ s16 unk_86;
    /* 0x88 */ s16 unk_88;
    /* 0x8A */ s16 unk_8A;
    /* 0x8C */ s16 uly;
    /* 0x8E */ s16 ulx;
    /* 0x90 */ s16 lrx;
    /* 0x92 */ s16 lry;
    /* 0x94 */ s16 fogStart;
    /* 0x96 */ s16 fogEnd;
    /* 0x98 */ s8 fogRed;
    /* 0x99 */ s8 fogGreen;
    /* 0x9A */ s8 fogBlue;
    /* 0x9B */ s8 fogAlpha;
    /* 0x9C */ s8 primRed;
    /* 0x9D */ s8 primGreen;
    /* 0x9E */ s8 primBlue;
    /* 0x9F */ s8 primAlpha;
    /* 0xA0 */ s8 primAlpha2;
    /* 0xA1 */ s8 fadeoutTimer;
    /* 0xA2 */ s8 unk_A2;
    /* 0xA3 */ s8 unk_A3;
    /* 0xA4 */ s8 bgPrimRed;
    /* 0xA5 */ s8 bgPrimGreen;
    /* 0xA6 */ s8 bgPrimBlue;
    /* 0xA7 */ s8 bgPrimAlpha;
    /* 0xA8 */ s8 unk_A8;
    /* 0xA9 */ s8 hiResEnabled;
    /* 0xAA */ s8 bufferEnabled;
    /* 0xAB */ s8 unk_AB;
    /* 0xAC */ s8 unk_AC;
    /* 0xAD */ s8 unk_AD;
    /* 0xAE */ s8 unk_AE;
    /* 0xAF */ s8 unk_AF;
    /* 0xB0 */ s16 viewportX;
    /* 0xB2 */ s16 viewportY;
    /* 0xB4 */ s16 viewport_unk_B4;
    /* 0xB6 */ s16 viewport_unk_B6;
    /* 0xB8 */ s16 viewportXOffset;
    /* 0xBA */ s16 viewportYOffset;
    /* 0xBC */ s16 viewport_unk_BC;
    /* 0xBE */ s16 viewport_unk_BE;
    /* 0xC0 */ s32 tempFiller[32];
    /* 0xC0 */
} GfxContext; // size = 0x188;
#endif //GFX_PATCHES_H
